Repository: ThinkInAIXYZ/clawdhome
Catalog: ClawdHome/Stable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# views.user_detail_view.abnormal_no_response
source: 异常（无响应）
en: Abnormal (no response)
zh_hant: Helper 資料

# views.user_detail_view.base_url
source: 基础 URL
en: Base URL
zh_hant: 基礎 URL

# views.user_detail_view.configuration_mode
source: 配置方式
en: Configuration Mode
zh_hant: 守護程序狀態、安裝快取、本地模型（root 專用）

# views.user_detail_view.current_model
source: 当前：%@
en: Current: %@
zh_hant: Helper 日誌

# views.user_detail_view.current_model_from_cli_hint
source: 当前模型来自“更多模型（命令行）”，可在下方切换到内置 UI 支持模型。
en: Current model comes from "More Models (CLI)". You can switch to a model supported by the built-in UI below.
zh_hant: JSONL 格式，最大 2MB，自動輪轉

# views.user_detail_view.custom_api_compatibility
source: API 兼容（默认 OpenAI）
en: API compatibility (default: OpenAI)
zh_hant: 公共資料夾和安全資料夾，用於人和蝦之間的檔案共享

# views.user_detail_view.custom_compatibility_picker
source: 兼容类型
en: Compatibility
zh_hant: 共享空間

# views.user_detail_view.custom_model
source: 模型
en: Model
zh_hant: 切換後會立即作用到所有視窗。

# views.user_detail_view.custom_model_id_placeholder
source: 输入模型 ID（例如 gpt-5.5 / claude-opus-4-7）
en: Enter model ID (e.g. gpt-5.5 / claude-opus-4-7)
zh_hant: 通用

# views.user_detail_view.custom_provider_id_optional
source: Provider ID（可选，默认 custom）
en: Provider ID (optional, default: custom)
zh_hant: 版本

# views.user_detail_view.delete_authorization_hint
source: 如果系统弹出授权窗口，请点击“允许”。如果你拒绝了，或者没有出现，请退出程序后重新操作。你也可以前往“系统设置 → 用户与群组”删除该用户。
en: If a system authorization prompt appears, click "Allow". If you denied it or no prompt appeared, quit and try again. You can also remove this user in "System Settings → Users & Groups".
zh_hant: 蝦塘顯示

# views.user_detail_view.delete_success_closing
source: 删除成功，即将关闭…
en: Deleted successfully, closing...
zh_hant: 使用 Touch ID 解鎖

# views.user_detail_view.delete_user_subtitle
source: 此操作不可恢复，请选择个人文件夹处理方式。
en: This action cannot be undone. Please choose how to handle the personal folder.
zh_hant: 當前已是最新版本

# views.user_detail_view.delete_user_title
source: 删除用户 @%@
en: Delete user @%@
zh_hant: 檢查失敗：%@

# views.user_detail_view.fallback_cli_recommended
source: 回退模型建议在命令行中管理。
en: Fallback models are best managed via CLI.
zh_hant: XPC 連線

# views.user_detail_view.fallback_models
source: 降级：%@
en: Fallback: %@
zh_hant: 會話連線中斷，正在自動重試...

# views.user_detail_view.fallback_none
source: 降级：无
en: Fallback: None
zh_hant: 命令啟動失敗：%@

# views.user_detail_view.force_kill_selected_sigkill
source: 强制结束选中进程 (%d, SIGKILL)
en: Force kill selected processes (%d, SIGKILL)

# views.user_detail_view.freeze
source: 该虾已冻结。
en: This shrimp is frozen.
zh_hant: 會話錯誤：%@

# views.user_detail_view.freeze_gateway_stop_freezestart
source: 该虾已冻结：Gateway 已停止，解除冻结后可再次启动。
en: This shrimp is frozen: Gateway has been stopped and can be started again after unfreezing.

# views.user_detail_view.json
source: JSON 语法错误：%@
en: JSON syntax error: %@

# views.user_detail_view.kill_process_confirmation
source: 终止进程 %@（PID %d）？
en: Terminate process %@ (PID %d)?
zh_hant: 輸入失敗：%@

# views.user_detail_view.kill_selected_process_count
source: 终止已选中的 %d 个进程？
en: Terminate %d selected processes?

# views.user_detail_view.kill_selected_sigterm
source: 终止选中进程 (%d, SIGTERM)
en: Terminate selected processes (%d, SIGTERM)
zh_hant: 重跑命令

# views.user_detail_view.kimi_code
source: Kimi Code 控制台
en: Kimi Code Console
zh_hant: 異常（無響應）

# views.user_detail_view.loading_process_base_info
source: 正在加载进程基础信息…
en: Loading process information...
zh_hant: 配置方式

# views.user_detail_view.minimax
source: MiniMax 控制台
en: MiniMax Console
zh_hant: 當前：%@

# views.user_detail_view.minimax_api_key
source: 粘贴 MiniMax API Key
en: Paste MiniMax API Key
zh_hant: 當前模型來自“更多模型（命令列）”，可在下方切換到內建 UI 支援模型。

# views.user_detail_view.more_models
source: 更多模型
en: More Models
zh_hant: API 相容（預設 OpenAI）

# views.user_detail_view.more_models_desc
source: 通过命令行交互配置，支持完整模型与回退策略。
en: Configure interactively via command line, with full model and fallback strategy support.
zh_hant: 相容型別

# views.user_detail_view.n
source: …以及另外 %@ 项
en: ...and %@ more items
zh_hant: 模型

# views.user_detail_view.n_8d3d10
source: 失败 %@ 项： %@
en: %@ items failed: %@
zh_hant: 輸入模型 ID（例如 gpt-5.5 / claude-opus-4-7）

# views.user_detail_view.n_macos
source: 管理员密码校验失败：%@ 请填写该 macOS 账户的登录密码（不是用户名）
en: Admin password verification failed: %@ Please enter the login password for this macOS account (not the username).
zh_hant: Provider ID（可選，預設 custom）

# views.user_detail_view.n_n_n
source: 路径： %@
en: Path: %@
zh_hant: 如果系統彈出授權視窗，請點選“允許”。如果你拒絕了，或者沒有出現，請退出程式後重新操作。你也可以前往“系統設定 → 使用者與群組”刪除該使用者。

# views.user_detail_view.no_process_data
source: 暂无进程数据
en: No process data available
zh_hant: 刪除成功，即將關閉…

# views.user_detail_view.old_model_cancel
source: 取消
en: Cancel
zh_hant: 此操作不可恢復，請選擇個人資料夾處理方式。

# views.user_detail_view.old_model_keep_fallback
source: 保留为备选
en: Keep as Fallback
zh_hant: 刪除使用者 @%@

# views.user_detail_view.old_model_prompt_title
source: 当前主模型 %@ 如何处理？
en: How to handle current primary model %@?
zh_hant: 回退模型建議在命令列中管理。

# views.user_detail_view.old_model_replace
source: 直接替换
en: Replace
zh_hant: 降級：%@

# views.user_detail_view.open_cli_config
source: 打开命令行配置
en: Open CLI Configuration
zh_hant: 降級：無

# views.user_detail_view.os_user_password
source: 获取 OS 用户密码
en: Get OS user password
zh_hant: 強制結束選中程序 (%d, SIGKILL)

# views.user_detail_view.pause_freeze_state
source: 已暂停(冻结)
en: Paused (Frozen)
zh_hant: 該蝦已凍結。

# views.user_detail_view.pid
source: @%@ 暂停冻结部分失败，未挂起 PID: %@
en: @%@ Partial pause-freeze failed; the following PIDs were not suspended: %@
zh_hant: 該蝦已凍結：Gateway 已停止，解除凍結後可再次啟動。

# views.user_detail_view.pid_0cbf36
source: @%@ 速冻部分失败，未终止 PID: %@
en: @%@ Quick-freeze partially failed; the following PIDs were not terminated: %@
zh_hant: JSON 語法錯誤：%@

# views.user_detail_view.pid_414c18
source: @%@ 速冻后检测到进程仍在运行（可能被自动拉起），PID: %@
en: @%@ Processes still running after quick-freeze (may have been auto-restarted), PID: %@
zh_hant: 終止程序 %@（PID %d）？

# views.user_detail_view.pid_e5e7a7
source: @%@ 解除暂停部分失败，未恢复 PID: %@
en: @%@ Partial resume failed; the following PIDs were not resumed: %@
zh_hant: 終止已選中的 %d 個程序？

# views.user_detail_view.pid_fabd0d
source: 进程详情 · PID %@
en: Process Details · PID %@
zh_hant: 終止選中程序 (%d, SIGTERM)

# views.user_detail_view.port
source: 基础信息已就绪，正在补充端口信息…
en: Basic info ready, loading port information...
zh_hant: Kimi Code 控制檯

# views.user_detail_view.process
source: 以下进程操作失败：
en: The following process operations failed:
zh_hant: 正在載入程序基礎資訊…

# views.user_detail_view.process_port_ready_count
source: 进程与端口数据已就绪（%d）
en: Process and port data ready (%d)
zh_hant: MiniMax 控制檯

# views.user_detail_view.process_sigterm
source: 终止进程 (SIGTERM)
en: Terminate Process (SIGTERM)
zh_hant: 貼上 MiniMax API Key

# views.user_detail_view.provider
source: 模型提供商
en: Model Provider
zh_hant: 更多模型

# views.user_detail_view.qiniu_ai_models
source: Qiniu AI 模型
en: Qiniu AI Models
zh_hant: 透過命令列互動配置，支援完整模型與回退策略。

# views.user_detail_view.restarting_gateway
source: 重启中…
en: Restarting…

source: 该虾已暂停冻结：openclaw 进程被挂起，解除冻结后会继续执行（内存不会释放）。
en: This shrimp is in paused-freeze mode: openclaw processes are suspended and will resume after unfreeze (memory is retained).
zh_hant: …以及另外 %@ 項

# views.user_detail_view.sigkill
source: 强制结束 (SIGKILL)
en: Force Kill (SIGKILL)
zh_hant: 失敗 %@ 項：

# views.user_detail_view.start
source: 启动中…
en: Starting...

# views.user_detail_view.statussync
source: 状态同步中…
en: Syncing status...
zh_hant: 管理員密碼校驗失敗：%@

# views.user_detail_view.suggested_models
source: 可选模型
en: Suggested Models
zh_hant: 請填寫該 macOS 賬戶的登入密碼（不是使用者名稱）

# views.user_detail_view.sysa_minctl_exit
source: 删除用户失败：sysadminctl exit %@
en: Failed to delete user: sysadminctl exit %@

# views.user_detail_view.text_020b8a41
source: 初始化向导状态写入失败：%@
en: Failed to write setup wizard status: %@

# views.user_detail_view.text_08170b91
source: 更新于 %@
en: Updated at %@
zh_hant: 路徑：

# views.user_detail_view.text_0a32bf3a
source: 管理员权限校验失败：%@
en: Admin permission verification failed: %@

# views.user_detail_view.text_1622dc9b
source: 未知
en: Unknown
zh_hant: 暫無程序資料

# views.user_detail_view.text_1eacd4c6
source: 保存失败：%@
en: Failed to save: %@
zh_hant: 取消

# views.user_detail_view.text_258fc51d
source: 体检
en: Health check
zh_hant: 保留為備選

# views.user_detail_view.text_298ac017
source: 环境正常
en: Environment healthy
zh_hant: 當前主模型 %@ 如何處理？

# views.user_detail_view.text_5a560471
source: 已选 %@ 个进程
en: %@ processes selected
zh_hant: 直接替換

# views.user_detail_view.text_5cce2fbd
source: 初始化向导状态修复失败：%@
en: Failed to repair setup wizard status: %@
zh_hant: 開啟命令列配置

# views.user_detail_view.text_6151cab2
source: 强制结束已选 (%@)
en: Force kill selected (%@)
zh_hant: 獲取 OS 使用者密碼

# views.user_detail_view.text_626047b9
source: 账号：%@
en: Account: %@
zh_hant: 已暫停(凍結)

# views.user_detail_view.text_6e1d141a
source: 删除用户 \"@%@\"
en: Delete user "@%@"
zh_hant: @%@ 暫停凍結部分失敗，未掛起 PID: %@

# views.user_detail_view.text_6ffeae31
source: 已选 %@
en: %@ selected
zh_hant: @%@ 速凍部分失敗，未終止 PID: %@

# views.user_detail_view.text_7b6b4044
source: 已上传 %@ 项。
en: %@ items uploaded.
zh_hant: @%@ 速凍後檢測到程序仍在執行（可能被自動拉起），PID: %@

# views.user_detail_view.text_7c8c2ef4
source: %@ 个问题
en: %@ issues
zh_hant: @%@ 解除暫停部分失敗，未恢復 PID: %@

# views.user_detail_view.text_82ba9ab1
source: @%@ 的登录密码
en: @%@ Password
zh_hant: 程序詳情 · PID %@

# views.user_detail_view.text_8559f26d
source: 累计 ↓ %@ ↑ %@
en: Total ↓ %@ ↑ %@
zh_hant: 基礎資訊已就緒，正在補充埠資訊…

# views.user_detail_view.text_948c087f
source: 检测到自定义源：%@。切换后将覆盖为上方选项。
en: Custom source detected: %@. Switching will overwrite it with the option above.
zh_hant: 以下程序操作失敗：

# views.user_detail_view.text_9d82e8aa
source: 删除用户失败：%@
en: Failed to delete user: %@

# views.user_detail_view.text_a1027837
source: 删除用户 %@ 后校验失败：系统记录仍存在
en: Verification failed after deleting user %@: system records still exist
zh_hant: 程序與埠資料已就緒（%d）

# views.user_detail_view.text_bc49b91a
source: 读取失败：%@
en: Read failed: %@
zh_hant: 終止程序 (SIGTERM)

# views.user_detail_view.text_cba971a5
source: 需要修复
en: Needs fix
zh_hant: 模型提供商

# views.user_detail_view.text_ceb875b6
source: 重新进入初始化向导失败：%@
en: Failed to re-enter setup wizard: %@
zh_hant: Qiniu AI 模型

# views.user_detail_view.text_d6a22312
source: 检查中…
en: Checking...
zh_hant: 重啟中…

# views.user_detail_view.text_daa9c1c7
source: + %@ 备用
en: + %@ fallback
zh_hant: 該蝦已暫停凍結：openclaw 程序被掛起，解除凍結後會繼續執行（記憶體不會釋放）。

# views.user_detail_view.text_dced7ba8
source: 重新体检
en: Recheck Health
zh_hant: 強制結束 (SIGKILL)

# views.user_detail_view.text_e80c7665
source: 终止已选 (%@)
en: Kill Selected (%@)
zh_hant: 啟動中…

# views.user_detail_view.text_e9b3435d
source: 创建目录失败：%@
en: Failed to create directory: %@
zh_hant: 狀態同步中…

# views.user_detail_view.text_f40c2690
source: %@ 个进程
en: %@ Processes
zh_hant: 可選模型

# views.user_detail_view.userprocess_freezestart
source: 该虾已速冻：已紧急终止用户空间进程，解除冻结后需手动重新启动服务。
en: This shrimp has been frozen: user-space processes were emergency-killed. After unfreezing, services must be restarted manually.
zh_hant: 刪除使用者失敗：sysadminctl exit %@

# views.user_detail_view.users
source: /Users/%@/ 保持不变
en: /Users/%@/ will be kept
zh_hant: 初始化嚮導狀態寫入失敗：%@

# views.user_detail_view.users_4c31c5
source: /Users/%@/ 及全部内容将被永久删除
en: /Users/%@/ and all its contents will be permanently deleted
zh_hant: 更新於 %@

# views.user_detail_view.view_details
source: 查看详情
en: View details
zh_hant: 管理員許可權校驗失敗：%@

# views.user_detail_view.zai_models
source: 智谱 Z.AI 模型
en: Zhipu Z.AI Models
zh_hant: 未知

# views.user_files_view.create_directory_failed_detail
source: 创建目录失败：%@
en: Failed to create directory: %@
zh_hant: 儲存失敗：%@

# views.user_files_view.extracting_item
source: 正在解压 %@…
en: Extracting %@...
zh_hant: 體檢

# views.user_files_view.folder
source: 无法枚举文件夹内容
en: Unable to enumerate folder contents
zh_hant: 環境正常

# views.user_files_view.json
source: JSON 语法错误：%@
en: JSON syntax error: %@
zh_hant: 已選 %@ 個程序

# views.user_files_view.localfile
source: 无法读取本地文件
en: Unable to read local file
zh_hant: 初始化嚮導狀態修復失敗：%@

# views.user_files_view.partial_upload_failed_items
source: 部分文件上传失败：%@
en: Some files failed to upload: %@
zh_hant: 強制結束已選 (%@)

# views.user_files_view.partial_upload_failed_items_count
source: 部分文件上传失败：%@ 等 %d 项
en: Some files failed to upload: %@ and %d more
zh_hant: 賬號：%@

# views.user_files_view.text_07f4232d
source: 重命名「%@」
en: Rename "%@"
zh_hant: 刪除使用者 \"@%@\"

# views.user_files_view.text_1b3c25ab
source: 重命名「%@」（后缀 %@ 将自动保留）
en: Rename "%@" (extension %@ will be kept automatically)
zh_hant: 已選 %@

# views.user_files_view.text_1de5d3a2
source: %@；等 %@ 项失败
en: %@; %@ more failed
zh_hant: 已上傳 %@ 項。

# views.user_files_view.text_92ed1d85
source: 「%@」是二进制文件，无法用文本编辑器打开
en: "%@" is a binary file and cannot be opened in a text editor
zh_hant: %@ 個問題

# views.user_files_view.text_f79700ab
source: 编辑：%@
en: Edit: %@
zh_hant: @%@ 的登入密碼

# views.user_files_view.text_f797a8c4
source: 删除「%@」？此操作不可撤销。
en: Delete "%@"? This action cannot be undone.
zh_hant: 累計 ↓ %@ ↑ %@

# views.user_files_view.uploading_item
source: 正在上传 %@…
en: Uploading %@...
zh_hant: 檢測到自定義源：%@。切換後將覆蓋為上方選項。

# views.user_files_view.uploading_progress_item
source: 正在上传 %d/%d：%@…
en: Uploading %d/%d: %@...
zh_hant: 刪除使用者失敗：%@

# views.user_files_view.action_copy
source: 复制
en: Copy
zh_hant: 刪除使用者 %@ 後校驗失敗：系統記錄仍存在

# views.user_files_view.action_move
source: 移动
en: Move
zh_hant: 讀取失敗：%@

# views.user_files_view.action_paste
source: 粘贴
en: Paste
zh_hant: 需要修復

# views.user_files_view.action_paste_to_current
source: 粘贴到当前目录
en: Paste to current folder
zh_hant: 重新進入初始化嚮導失敗：%@

# views.user_files_view.transfer_done_copy
source: 复制完成
en: Copy completed
zh_hant: 檢查中…

# views.user_files_view.transfer_done_move
source: 移动完成
en: Move completed
zh_hant: + %@ 備用

# views.user_files_view.transfer_mode_copy
source: 复制
en: Copy
zh_hant: 重新體檢

# views.user_files_view.transfer_mode_move
source: 移动
en: Move
zh_hant: 終止已選 (%@)

# views.user_files_view.transfer_partial_failed_count
source: %@；等 %@ 项失败
en: %@; %@ more failed
zh_hant: 建立目錄失敗：%@

# views.user_files_view.transfer_in_progress
source: %@中：%@/%@
en: %@ in progress: %@/%@

# views.user_files_view.transfer_pending_multiple
source: %@队列：%@ 项，进入目标目录后点击“粘贴”。
en: %@ queue: %@ items. Go to target folder and click Paste.
zh_hant: %@ 個程序

# views.user_files_view.transfer_pending_single
source: %@队列：%@，进入目标目录后点击“粘贴”。
en: %@ queue: %@. Go to target folder and click Paste.
zh_hant: 該蝦已速凍：已緊急終止使用者空間程序，解除凍結後需手動重新啟動服務。

# views.user_files_view.transfer_prepared_multiple
source: %@队列已准备：%@ 项
en: %@ queue ready: %@ items
zh_hant: /Users/%@/ 保持不變

# views.user_files_view.transfer_prepared_single
source: %@队列已准备：%@
en: %@ queue ready: %@
zh_hant: /Users/%@/ 及全部內容將被永久刪除

# views.user_init_wizard_view.advanced_options
source: 高级选项
en: Advanced options
zh_hant: 檢視詳情

# views.user_init_wizard_view.back
source: 上一步
en: Back
zh_hant: 智譜 Z.AI 模型

# views.user_init_wizard_view.channel
source: IM 绑定
en: IM Binding
zh_hant: 建立目錄失敗：%@

# views.user_init_wizard_view.check_log_output_details_then_retry_restart
source: 请查看日志输出了解详情，然后重试或重新开始。
en: Check log output for details, then retry or restart.
zh_hant: 正在解壓 %@…

# views.user_init_wizard_view.checking_xcode_environment_log
source: ▶ 检查 Xcode 开发环境
en: ▶ Checking Xcode development environment
zh_hant: 無法列舉資料夾內容

# views.user_init_wizard_view.clt
source: CLT 已安装
en: CLT Installed
zh_hant: JSON 語法錯誤：%@

# views.user_init_wizard_view.clt_not_installed
source: CLT 未安装
en: CLT Not Installed
zh_hant: 無法讀取本地檔案

# views.user_init_wizard_view.configuration_npm_directory
source: 配置 npm 目录
en: Configure npm Directory
zh_hant: 部分檔案上傳失敗：%@

# views.user_init_wizard_view.continue
source: 继续剩余步骤
en: Continue
zh_hant: 部分檔案上傳失敗：%@ 等 %d 項

# views.user_init_wizard_view.current_progress
source: 当前进度
en: Current progress
zh_hant: 重新命名「%@」

# views.user_init_wizard_view.development_environment_repair
source: 开发环境修复
en: Development environment repair
zh_hant: 重新命名「%@」（字尾 %@ 將自動保留）

# views.user_init_wizard_view.done
source: 在独立窗口生成二维码，扫码完成配对。
en: A QR code will be generated in a separate window. Scan it to complete pairing.
zh_hant: %@；等 %@ 項失敗

# views.user_init_wizard_view.done_continue
source: 已完成，继续
en: Done, Continue
zh_hant: 「%@」是二進位制檔案，無法用文字編輯器開啟

# views.user_init_wizard_view.done_overview
source: 正在启动 OpenClaw Gateway…
en: Starting OpenClaw Gateway...
zh_hant: 編輯：%@

# views.user_init_wizard_view.donewechat
source: 在独立窗口生成二维码，扫码完成微信配对。
en: A QR code will be generated in a separate window. Scan it to complete WeChat pairing.
zh_hant: 刪除「%@」？此操作不可撤銷。

# views.user_init_wizard_view.feishu
source: 飞书扫码绑定
en: Link via Feishu
zh_hant: 正在上傳 %@…

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 正在获取 Web UI Token…
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Fetching Web UI token...
zh_hant: 正在上傳 %d/%d：%@…

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 运行状态已确认。\n
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway running state confirmed.\n
zh_hant: 複製

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 启动失败：\(error.localizedDescription)
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway start failed: \(error.localizedDescription)
zh_hant: 移動

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 启动成功。
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway started successfully.
zh_hant: 貼上

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 状态同步超时，概览页会在后续轮询中继续刷新。\n
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway status sync timed out. Overview polling will continue refreshing.\n
zh_hant: 貼上到當前目錄

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 正在启动 Gateway…
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Starting Gateway...
zh_hant: 複製完成

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 已切换到概览页，继续后台启动 Gateway。
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Switched to Overview. Continuing Gateway startup in background.
zh_hant: 移動完成

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token 获取成功。
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token acquired successfully.
zh_hant: 複製

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token 暂未就绪（\(attempt)/\(maxAttempts)），继续等待…
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token not ready yet (\(attempt)/\(maxAttempts)); waiting...
zh_hant: 移動

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token 获取超时，未自动打开 Web UI。
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Token request timed out; Web UI was not opened automatically.
zh_hant: %@；等 %@ 項失敗

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 等待 Gateway 进入运行态（\(attempt)/\(maxAttempts)）…\n
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Waiting for Gateway to enter running state (\(attempt)/\(maxAttempts))...\n
zh_hant: %@佇列：%@ 項，進入目標目錄後點擊“貼上”。

source: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Web UI 已打开。
en: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Web UI opened.
zh_hant: %@佇列：%@，進入目標目錄後點擊“貼上”。

# views.user_init_wizard_view.gateway
source: Gateway 已运行。
en: Gateway is running.
zh_hant: %@佇列已準備：%@ 項

# views.user_init_wizard_view.gateway_activation_hint
source: 首次启动可能需要一点时间，请保持窗口开启。
en: The first startup may take a little time. Keep this window open.
zh_hant: %@佇列已準備：%@

# views.user_init_wizard_view.gateway_start
source: Gateway 未运行，正在启动…
en: Gateway is not running. Starting...
zh_hant: 高階選項

# views.user_init_wizard_view.gateway_start_error_localizeddescription
source: Gateway 启动失败：\(error.localizedDescription)
en: Gateway failed to start: \(error.localizedDescription)
zh_hant: 上一步

# views.user_init_wizard_view.gateway_start_success
source: Gateway 启动成功。
en: Gateway started successfully.
zh_hant: IM 繫結

# views.user_init_wizard_view.hide
source: 隐藏
en: Hide
zh_hant: 請檢視日誌輸出瞭解詳情，然後重試或重新開始。

# views.user_init_wizard_view.hintdone
source: 已触发系统安装窗口，请按提示完成安装。
en: System installation window has been triggered. Please follow the prompts to complete installation.

# views.user_init_wizard_view.initialization_completed
source: 配置完成
en: Setup Complete
zh_hant: ▶ 檢查 Xcode 開發環境

# views.user_init_wizard_view.initialization_paused
source: 初始化已暂停
en: Initialization paused

# views.user_init_wizard_view.install_developer_tools
source: 安装开发工具
en: Install developer tools
zh_hant: CLT 已安裝

# views.user_init_wizard_view.installing_tools
source: 安装中…
en: Installing...
zh_hant: CLT 未安裝

# views.user_init_wizard_view.license_refreshstatus
source: 已执行 license 接受，正在刷新状态。
en: License accepted. Refreshing status...
zh_hant: 配置 npm 目錄

# views.user_init_wizard_view.maintenance_tools
source: 维护工具
en: Maintenance tools
zh_hant: 繼續剩餘步驟

# views.user_init_wizard_view.models
source: 模型
en: Models
zh_hant: 當前進度

# views.user_init_wizard_view.models_channelconfigurationdone
source: 正在启动 OpenClaw Gateway…
en: Starting OpenClaw Gateway...
zh_hant: 開發環境修復

# views.user_init_wizard_view.node_js
source: 安装 Node.js
en: Install Node.js
zh_hant: 在獨立視窗生成二維碼，掃碼完成配對。

# views.user_init_wizard_view.npm
source: npm 安装源
en: npm Registry
zh_hant: 已完成，繼續

# views.user_init_wizard_view.open
source: 点击打开
en: Open
zh_hant: 正在啟動 OpenClaw Gateway…

# views.user_init_wizard_view.open_settings_command_line_tools
source: 已打开“软件更新”。若弹窗未出现，可在系统设置中手动安装 Command Line Tools。
en: "Software Update" has been opened. If the prompt doesn't appear, you can manually install Command Line Tools from System Settings.
zh_hant: 在獨立視窗生成二維碼，掃碼完成微信配對。

# views.user_init_wizard_view.open_software_update
source: 打开软件更新
en: Open Software Update
zh_hant: 飛書掃碼繫結

# views.user_init_wizard_view.open_web_ui
source: 正在打开 Web UI…
en: Opening Web UI...
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 正在獲取 Web UI Token…

# views.user_init_wizard_view.openclaw_openclawversionlabelforui
source: 安装 openclaw (\(openclawVersionLabelForUI))
en: Install openclaw (\(openclawVersionLabelForUI))

# views.user_init_wizard_view.processing
source: 处理中…
en: Processing...
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 執行狀態已確認。\n

# views.user_init_wizard_view.re_initialize
source: 重新初始化
en: Re-initialize
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 啟動失敗：\(error.localizedDescription)

# views.user_init_wizard_view.refreshstatus
source: 刷新状态
en: Refresh Status

# views.user_init_wizard_view.restart
source: 重新开始
en: Restart
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 啟動成功。

# views.user_init_wizard_view.resume_detected_pending_steps
source: 检测到步骤未运行但未完成，可继续执行剩余步骤。
en: Pending steps detected that haven't been run. You can continue with the remaining steps.

# views.user_init_wizard_view.retry_failed_step
source: 重试失败步骤
en: Retry failed step
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] Gateway 狀態同步超時，概覽頁會在後續輪詢中繼續重新整理。\n

# views.user_init_wizard_view.run
source: 已有初始化命令正在运行
en: An initialization command is already running
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 正在啟動 Gateway…

# views.user_init_wizard_view.save
source: 保存中…
en: Saving...

# views.user_init_wizard_view.savecontinue
source: 保存并继续
en: Save & Continue
zh_hant: [finish] [\(Self.finishProgressTimeFormatter.string(from: Date()))] 已切換到概覽頁，繼續後臺啟動 Gateway。

# views.user_init_wizard_view.select_ai_provider
source: 选择 AI Provider
en: Select AI Provider
